limin1224/QuanQuanTeachUSB/AT90USB162/Usb2Uart/UsbCore.c
 /*****  以下为接口1（数据类接口）的端点描述符  *****/
 /*************** 批量输入端点3描述符 ******************/
 //bLength字段。端点描述符长度为7字节。
 0x07,
 
 //bDescriptorType字段。端点描述符编号为0x05。
 0x05,
 
 //bEndpointAddress字段。端点的地址。我们使用AT90USB162的输入端点3。
 //D7位表示数据方向，输入端点D7为1。所以输入端点1的地址为0x83。
 0x83,
 
 //bmAttributes字段。D1~D0为端点传输类型选择。
 //该端点为批量端点，批量端点的编号为0x02。其它位保留为0。
 0x02,
 
 //wMaxPacketSize字段。该端点的最大包长。端点2的最大包长为64字节。
 //注意低字节在先。
 0x40,
 0x00,
 
 //bInterval字段。端点查询的时间，这里对批量端点无效。
 0x00,
 
 /*************** 批量输出端点4描述符 ******************/
 //bLength字段。端点描述符长度为7字节。
 0x07,
 
 //bDescriptorType字段。端点描述符编号为0x05。
 0x05,
 
 //bEndpointAddress字段。端点的地址。我们使用AT90USB162的输出端点4。
 //D7位表示数据方向，输出端点D7为0。所以输出端点2的地址为0x04。
 0x04,
 
 //bmAttributes字段。D1~D0为端点传输类型选择。
 //该端点为批量端点，批量端点的编号为0x02。其它位保留为0。
 0x02,
 
 //wMaxPacketSize字段。该端点的最大包长。端点2的最大包长为64字节。
 //注意低字节在先。
 0x40,
 0x00,
 
 //bInterval字段。端点查询的时间，这里对批量端点无效。
 0x00
};
////////////////////////配置描述符集合完毕//////////////////////////

/************************语言ID的定义********************/
const uint8 LanguageId[4]=
{
 0x04, //本描述符的长度
 0x03, //字符串描述符
 //0x0409为美式英语的ID
 0x09,
 0x04
};
////////////////////////语言ID完毕//////////////////////////////////

//**************************************************/
//*********        本转换结果来自         **********/
//********* Http://computer00.21ic.org    **********/
//*********        作者: 电脑圈圈         **********/
//*********         欢迎大家使用          **********/
//*********    版权所有，盗版请写明出处   **********/
//**************************************************/

//http://computer00.21ic.org/user1/2198/archives/2007/42769.html
//字符串“电脑圈圈的USB专区 Http://group.ednchina.com/93/”的Unicode编码
//8位小端格式
const uint8 ManufacturerStringDescriptor[82]={
82,         //该描述符的长度为82字节
0x03,       //字符串描述符的类型编码为0x03
0x35, 0x75, //电
0x11, 0x81, //脑
0x08, 0x57, //圈
0x08, 0x57, //圈
0x84, 0x76, //的
0x55, 0x00, //U
0x53, 0x00, //S
0x42, 0x00, //B
0x13, 0x4e, //专
0x3a, 0x53, //区
0x20, 0x00, // 
0x48, 0x00, //H
0x74, 0x00, //t
0x74, 0x00, //t
0x70, 0x00, //p
0x3a, 0x00, //:
0x2f, 0x00, ///
0x2f, 0x00, ///
0x67, 0x00, //g
0x72, 0x00, //r
0x6f, 0x00, //o
0x75, 0x00, //u
0x70, 0x00, //p
0x2e, 0x00, //.
0x65, 0x00, //e
0x64, 0x00, //d
0x6e, 0x00, //n
0x63, 0x00, //c
0x68, 0x00, //h
0x69, 0x00, //i
0x6e, 0x00, //n
0x61, 0x00, //a
0x2e, 0x00, //.
0x63, 0x00, //c
0x6f, 0x00, //o
0x6d, 0x00, //m
0x2f, 0x00, ///
0x39, 0x00, //9
0x33, 0x00, //3
0x2f, 0x00  ///
};
/////////////////////////厂商字符串结束/////////////////////////////

//字符串“《圈圈教你玩USB》之 USB转串口”的Unicode编码
//8位小端格式
const unsigned char ProductStringDescriptor[38]={
38,         //该描述符的长度为38字节
0x03,       //字符串描述符的类型编码为0x03
0x0a, 0x30, //《
0x08, 0x57, //圈
0x08, 0x57, //圈
0x59, 0x65, //教
0x60, 0x4f, //你
0xa9, 0x73, //玩
0x55, 0x00, //U
0x53, 0x00, //S
0x42, 0x00, //B
0x0b, 0x30, //》
0x4b, 0x4e, //之
0x20, 0x00, // 
0x55, 0x00, //U
0x53, 0x00, //S
0x42, 0x00, //B
0x6c, 0x8f, //转
0x32, 0x4e, //串
0xe3, 0x53  //口
};
////////////////////////产品字符串结束////////////////////////////

//字符串“2009-05-11”的Unicode编码
//8位小端格式
const uint8 SerialNumberStringDescriptor[22]={
22,         //该描述符的长度为22字节
0x03,       //字符串描述符的类型编码为0x03
0x32, 0x00, //2
0x30, 0x00, //0
0x30, 0x00, //0
0x39, 0x00, //9
0x2d, 0x00, //-
0x30, 0x00, //0
0x35, 0x00, //5
0x2d, 0x00, //-
0x31, 0x00, //1
0x31, 0x00  //1
};
//////////////////////产品序列号字符串结束/////////////////////////

/********************************************************************
函数功能：总线挂起中断处理函数。
入口参数：无。
返    回：无。
备    注：无。
********************************************************************/
void UsbBusSuspend(void)
{
#ifdef DEBUG0
 Prints("USB总线挂起。\r\n");
#endif
}
////////////////////////End of function//////////////////////////////

/********************************************************************
函数功能：总线复位中断处理函数。
入口参数：无。
返    回：无。
备    注：无。
********************************************************************/
void UsbBusReset(void)
{
#ifdef DEBUG0
 Prints("USB总线复位。\r\n");
#endif
 UsbChipResetEndpoint(); //复位端点
 ConfigValue=0; //配置值初始化为0
 UsbChipSetConfig(0);  //设置芯片的配置值为0
 NeedZeroPacket=0;
 SendLength=0;
 Ep1InIsBusy=0;  //复位后端点1输入缓冲区空闲。
 Ep3InIsBusy=0;  //复位后端点3输入缓冲区空闲。
}
////////////////////////End of function//////////////////////////////

/********************************************************************
函数功能：根据pData和SendLength将数据发送到端点0的函数。
入口参数：无。
返    回：无。
备    注：由pSendData的最高8位决定指针的类型，当最高8位为0x01时，指向RAM区，
          否则指向FLASH区。
********************************************************************/ 
void UsbEp0SendData(void)
{
 //将数据写到端点中去准备发送
 //写之前要先判断一下需要发送的数据是否比端点0
 //最大长度大，如果超过端点大小，则一次只能发送
 //最大包长的数据。端点0的最大包长在DeviceDescriptor[7]
 if(SendLength>DeviceDescriptor[7])
 {
  //按最大包长度发送
  if((pSendData&0xFF000000)==0x01000000)  //RAM中的数据
  {
   UsbChipWriteEndpointBuffer(0,DeviceDescriptor[7],(uint8 *)(pSendData&0xFFFF));
  }
  else //FLASH中的数据
  {
   DataInFlash_WriteEndpointBuffer(0,DeviceDescriptor[7],(flash uint8 *)(pSendData&0xFFFF));
  }
  //发送后剩余字节数减少最大包长
  SendLength-=DeviceDescriptor[7];
  //发送一次后指针位置要调整
  pSendData+= DeviceDescriptor[7];
 }
 else
 {
  if(SendLength!=0)
  {
   //不够最大包长，可以直接发送
   if((pSendData&0xFF000000)==0x01000000)  //RAM中的数据
   {
    UsbChipWriteEndpointBuffer(0,SendLength,(uint8 *)(pSendData&0xFFFF));
   }
   else //FLASH中的数据
   {
    DataInFlash_WriteEndpointBuffer(0,SendLength,(flash uint8 *)(pSendData&0xFFFF));
   }
   //发送完毕后，SendLength长度变为0
   SendLength=0;
  }
  else //如果要发送的数据包长度为0
  {
   if(NeedZeroPacket==1) //如果需要发送0长度数据
   {
    UsbChipWriteEndpointBuffer(0,0,0); //发送0长度数据包
    NeedZeroPacket=0; //清需要发送0长度数据包标志
   }
  }
 }
}
////////////////////////End of function//////////////////////////////

/********************************************************************
函数功能：USB端点0数据过程数据处理函数。
入口参数：无。
返    回：无。
备    注：该函数用来处理0端点控制传输的数据或状态过程。
********************************************************************/
void UsbEp0DataOut(void)
{
 //由于本程序中只有一个请求输出数据，所以可以直接使用if语句判断条件，
 //如果有很多请求的话，使用if语句就不方便了，而应该使用switch语句散转。
 if((bmRequestType==0x21)&&(bRequest==SET_LINE_CODING))
 {
  uint32 BitRate;
  uint8 Length;  
  //读回7字节的LineCoding值
  Length=UsbChipReadEndpointBuffer(0,7,LineCoding);
  UEINTX=~(1<<2); //清除RXOUTI，将清除中断标志以及缓冲区
  
  if(Length==7) //如果长度正确
  {
   //从LineCoding计算设置的波特率
   BitRate=LineCoding[3];
   BitRate=(BitRate<<8)+LineCoding[2];
   BitRate=(BitRate<<8)+LineCoding[1];
   BitRate=(BitRate<<8)+LineCoding[0];
  #ifdef DEBUG0
   Prints("波特率设置为：");
   PrintLongInt(BitRate);
   Prints("bps\r\n");
  #endif
   //设置串口的波特率
   BitRate=UartSetBitRate(BitRate);
   
   //将LineCoding的值设置为实际的设置值
   LineCoding[0]=BitRate&0xFF;
   LineCoding[1]=(BitRate>>8)&0xFF;
   LineCoding[2]=(BitRate>>16)&0xFF;
   LineCoding[3]=(BitRate>>24)&0xFF;
  
   //由于只支持一停止位、无校验、8位数据位，
   //所以固定这些数据。
   LineCoding[4]=0x00;
   LineCoding[5]=0x00;
   LineCoding[6]=0x08;
  }
  //返回0长度的状态数据包。
  UsbChipWriteEndpointBuffer(0,0,0);
 }
 else  //其它请求的数据过程或者状态过程
 {
  UsbChipReadEndpointBuffer(0,16,Buffer);
  UEINTX=~(1<<2); //清除RXOUTI，将清除中断标志以及缓冲区
 }
}
////////////////////////End of function//////////////////////////////

